# ScheduleFieldId Operators (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleFieldId Operators
ScheduleFieldId Class See Also
---
The ScheduleFieldId type exposes the following members.
# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Determines whether two ScheduleFieldIds are the same. |
| Inequality | Determines whether two ScheduleFieldId are different. |

# See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace